# SurfaceRotation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedLayered..::..SurfaceRotation Property
AdvancedLayered Class See Also
---
The property labeled "Rotation" from the "AdvancedLayered" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string SurfaceRotation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceRotation As String
	Get
```

Visual C++
---
```text
public:
static property String^ SurfaceRotation {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble". This property allows a connected asset.
# See Also
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace